#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Wed Jun 12 17:23:49 2024

set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ABorCD
add_design "D:/pdsproject/project/project1/AorB/test2/test2_1/AandB/ABorCD/source/ABorCD1.v"
remove_design -force -verilog "D:/pdsproject/project/project1/AorB/test2/test2_1/AandB/ABorCD/source/ABorCD1.v"
add_constraint "D:/pdsproject/project/project1/AorB/test2/test2_1/AandB/ABorCD/source/ABorCD.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ABorCD
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ABorCD
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ABorCD
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
