#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Wed Jun  5 16:34:47 2024

add_design "C:/Users/r9000/project/project/source/jishuqi.v"
add_design "C:/Users/r9000/project/project/source/gate74LS161.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishu
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/r9000/project/project/project.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_constraint  -logic -fdc "C:/Users/r9000/project/project/project.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/r9000/project/project/project.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module jishuqi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
