#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Tue May 14 18:46:18 2024

gen_netlist 
report_power 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module AorB
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
