#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Wed Jun 12 17:31:01 2024

add_design "C:/Users/67416/123/abc/11/source/cece.v"
add_constraint "C:/Users/67416/123/abc/11/source/yihuo.fdc"
add_design "C:/Users/67416/123/abc/source/gate74LS00.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module cece
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module cece
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module cece
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
