#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Wed Jun  5 17:06:46 2024

add_design "C:/Users/r9000/project1/project/source/NHJSQ.v"
add_design "C:/Users/r9000/project1/project/source/gate74LS194.v"
add_design "C:/Users/r9000/project1/project/source/gate74LS20.v"
add_design "C:/Users/r9000/project1/project/source/gate74LS00.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/r9000/project1/project/source/project.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module NHJSQ
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
